package com.kotlin.action.ch02.book.小结


/**
 *createBy keepon
 */
//• fun 关键字用来声明函数。va l 关键字和var 关键字分别用来声明只读变量
//和可变变量。
//· 字符串模板帮助你避免烦琐的字符串连接。在变量名称前加上$前缀或者用
//$｛｝包围一个表达式，来把值注入到字符串中。
//· 值对象类在Kotlin 中以简洁的方式表示。
//· 熟悉的if 现在是带返回值的表达式。
//• when 表达式类似于Java 中的switch 但功能更强大。
//· 在检查过变量具有某种类型之后不必显式地转换它的类型：编译器使用智能
//转换自动帮你完成。
//• for, while 和do-while 循环与Java 类似，但是for 循环现在更加方便，
//特别是当你需要法代map 的时候，又或是迭代集合需要下标的时候。
//· 简洁的语法1. . 5 会创建一个区间。区间和数列允许Kotlin 在f o r 循环中使
//用统一的语法和同一套抽象机制，并且还可以使用in 运算符和！川运算符
//来检查值是否属于某个区间。
//• Kotlin 中的异常处理和Java 非常相似，除了Koti in 不要求你声明函数可以抛
//出的异常。