package com.kotlin.action.ch01.小结.kt

/**
 *createBy keepon
 */
//1.6 小结
//• Kotlin 是静态类型语言并支持类型推导，允许维护正确性与性能的同时保持
//源代码的简洁。
//• Kotlin 支持面向对象和函数式两种编程风格，通过头等函数使更高级别的抽
//象成为可能，通过支持不可变值简化了测试和多线程开发。
//·在服务器端应用程序中它工作得很好， 全面支持所有现存的Java 框架，为常
//见的任务提供了新工具，如生成HTML 和持久化。
//·在Android 上它也可以工作，这得益于紧凑的运行时、对Android AP！特殊的
//编译器支持以及丰富的库， 为常见Android 开发任务提供了Kotlin 友好的
//函数。
//·它是免费和开源的，全面支持主流的IDE 和构建系统。
//• Ki。由1 是务实的、安全的、简洁的，与Java 可互操作，意味着它专注于使用己经
//证明过的解决方案处理常见任务，防止常见的像NullPointerException
//这样的错误，支持紧凑和易读的代码，以及提供与Java 无限制的集成。